{ "hits" : [ {"title":"so seems like this particular piece has 30% less capacity than the ...","review":"Bought this product from Cloudtail India during one of the Amazon sales.What comes in the box:10400mAh Powerbank, Charging cable, instruction manual.Charging:I have an phone with a battery capacity of approx 3000 mAh and the power bank gives me about 2-2.5 charges... so seems like this particular piece has 30% less capacity than the 10400 mAh.Size & Weight:I have to say that this product is larger than i thought it would be when i bought it. It is about 5.5 inches long - which is about the size of a pen, 2 inches tall and 1 inch high.This being said, it is pretty light and can easily be carried around in your bag but probably would not fit in your pocket.Overall, i think that for many people a battery pack with a single charge might be easier to carry around and do the trick of getting your phone through the entire day... but if you are constantly on the move or need the exrta capacity, this would be a great bet.","rating":"4.0","score":3,"comparative":0.01639344262295082,"effective":0.06557377049180328,"wordLength":5},{"title":"Not a good one","review":"I thought Lenovo is a good brand, but thinking is not always right.Reviewing it after use of 1 year.Battery is the most Important thing as it is shown it's of 10400 mah power, but its actually capacity is 5k-5.5k,Looks like a duplicate one,Maybe amazon has cheated,After using ut for a 1 year its capacity had decreased to abt. 4k mah..So buy intex or syska at the place of this lenovo... Otherwise its everyone's own thinking.. all the best ha, coz if u gonna buy it then u would need a good ATB.","rating":"1.0","score":15,"comparative":0.14285714285714285,"effective":0.14285714285714285,"wordLength":6},{"title":"I hate this - useless : stopped working in 2 months.","review":"HiI purchased the Lenovo Power bank on 1st June 2015 : pretty expensive viz a viz other power banks. I started to make use of the same around October 2015 and it has stopped working.This is soooo depressing and dejection for Lenovo.I hate this product and suggest noone should ever buy this.Replacement also not possible.","rating":"1.0","score":-5,"comparative":-0.07352941176470588,"effective":-0.07352941176470588,"wordLength":4},{"title":"Power bank charging does not get completed.","review":"Even after keeping the power bank for charging for 24 hours, the charging does not end, and the fourth step light keeps blinking. So its not getting charged fully. I guess the inside batteries may be from old stock with expired life. May be the reason for heavy discount.Initiated return of the product.","rating":"1.0","score":-3,"comparative":-0.045454545454545456,"effective":-0.045454545454545456,"wordLength":1},{"title":"Lost it, that's why I don't like it","review":"Lol. As far as getting the job done is concerned, this is a nice product and charges my phone at least twice before dying out. However, the casing is prone to visible scratches making it look ugly and dirty easily, if possible, get a different colour","rating":"1.0","score":-6,"comparative":-0.1016949152542373,"effective":-0.1016949152542373,"wordLength":7},{"title":"Short life","review":"Writing review after 11 months of uses.Now after 11 months the backup of this power bank has drastically reduced. Right now it's almost having 50% of the strength as compared to the day one. It seems it may not work more than 2 months from now.","rating":"3.0","score":2,"comparative":0.03389830508474576,"effective":0.1016949152542373,"wordLength":1},{"title":"Horrible Quality- Never Buy","review":"This product couldn't even survive for a week and one of the USB port came out from board. I requested Amazon for the replacement before but they didnt initiate anything. Will never recommend anyone else to buy this ugly product.","rating":"1.0","score":-1,"comparative":-0.018867924528301886,"effective":-0.018867924528301886,"wordLength":2},{"title":"Money waste","review":"Very bod quality. Need to charge 12 or 14 hours for full charge and i can charge my Lenovo K4 note only once.Money Waste !I want to return this.Having i year warranty. I want to return this item. Pls cooperate.","rating":"1.0","score":3,"comparative":0.05660377358490566,"effective":0.05660377358490566,"wordLength":4},{"title":"Pl do not buy","review":"Does not even complete a second charge for a 3000 maH battery phone.Takes long time to recharge itself and also while charging the phone.I had bought it because of the brand but I regret that.","rating":"1.0","score":-2,"comparative":-0.041666666666666664,"effective":-0.041666666666666664,"wordLength":1},{"title":"A Great product!","review":"Genuine Product from a genuine manufacturer.It comes with a small USB type B charging cable, useful for charging compatible phones.Only downside is that it's quite heavy.","rating":"4.0","score":0,"comparative":0,"effective":0,"wordLength":2}] }
